<?php
/**
 * Created by PhpStorm.
 * User: kela10
 * Date: 2017/8/1
 * Time: 17:41
 */


class  paramsHelper{

    public static  function getParams($key){
        return isset(self::$array[$key]) ? self::$array[$key] : [];
    }

    public static function echoOption($key,$value=''){
        $items=self::getParams($key);
        $str="";
        foreach ($items as $hiddenValue=>$displayText) {
            $selected=$value==$hiddenValue?"selected":'';
            $option="<option value=\"".$hiddenValue."\"  {$selected} >".$displayText."</option>";
            $str=$str.$option;
        }
        return $str;
    }

    public static function echoArrayOption($array,$displayValue,$displayText,$selectedValue){
        $str="";
        foreach ($array as $item) {
            $selected=$item[$displayValue]==$selectedValue?"selected":'';
            $option="<option value=\"".$item[$displayValue]."\"  {$selected} >".$item[$displayText]."</option>";
            $str=$str.$option;
        }
        return $str;
    }

    public static function echoOptionText($key,$value=''){
        $items=self::getParams($key);
        $str="";
        foreach ($items as $hiddenValue=>$displayText) {
            if($value==$hiddenValue){
                return $displayText;
            }
        }
        return $str;
    }

    private static $array=[
        'shape'=>[
            '1'=>'圆形',
            '2'=>'公主方形',
            '3'=>'祖母绿形',
            '4'=>'橄榄形',
            '5'=>'椭圆形',
            '6'=>'水滴形',
            '7'=>'心形',
            '8'=>'坐垫形',
            '9'=>'辐射形',
            '10'=>'方形辐射形',
            '11'=>'方形祖母绿',
            '12'=>'三角形',
            '13'=>'戒指托',
            '14'=>'异形',
            '15'=>'梨形',
            '16'=>'阿斯切',
            '17'=>'马眼形',
            '18'=>'长方形',
            '19'=>'雷迪恩形',
        ],
        'cut'=>[
            'EX'=>'EX',
            'VG'=>'VG',
            'G'=>'G',
            'Fair'=>'Fair'
        ],
        'symmetry'=>[
            'EX'=>'EX',
            'VG'=>'VG',
            'G'=>'G',
            'Fair'=>'Fair'
        ],
        'polish'=>[
            'EX'=>'EX',
            'VG'=>'VG',
            'G'=>'G',
            'Fair'=>'Fair'
        ],
        'jinse' => [
            '白' => '白',
            '黄' => '黄',
            '玫瑰金' => '玫瑰金',
            '分色' => '分色',
            '彩金' => '彩金',
            '玫瑰黄' => '玫瑰黄',
            '玫瑰白' => '玫瑰白',
            '黄白' => '黄白',
        ],
        'put_type' => [
            '1' => '购买',
            '2' => '委托加工',
            '3' => '代销',
            '4' =>'借入',
            '5' =>'自采',
        ],
        'tuo_type' => [
            '1' => '成品',
            '2' => '空托',
        ],
        'zhengshu_type' => [
            'HRD-D' => 'HRD-D',
            'GIA' => 'GIA',
            'HRD' => 'HRD',
            'IGI' => 'IGI',
            'DIA' => 'DIA',
            'EGL' => 'EGL',
            'NGTC' => 'NGTC',
            'NGGC' => 'NGGC',
            'HRD-S' => 'HRD-S',
            'NGSTC' => 'NGSTC',
        ],
        'yanse' => [
            'D' => 'D',
            'E' => 'E',
            'F' => 'F',
            'G' => 'G',
            'H' => 'H',
            'I' => 'I',
            'J' => 'J',
            'K' => 'K',
            'L' => 'L',
            'M' => 'M',
            'N' => 'N',
        ],
        'jingdu' => [
            'FL' => 'FL',
            'IF' => 'IF',
            'VVS1' => 'VVS1',
            'VVS2' => 'VVS2',
            'VVS' => 'VVS',
            'VS1' => 'VS1',
            'VS2' => 'VS2',
            'VS' => 'VS',
            'SI1' => 'SI1',
            'SI2' => 'SI2',
            'SI' => 'SI',
            'I' => 'I',
            '不分级' => '不分级',
        ],
        'caizhi' => [
            '9K' => '9K',
            '10K' => '10K',
            '14K' => '14K',
            '18K' => '18K',
            'PT900' => 'PT900',
            'PT950' => 'PT950',
            'PT990' => 'PT990',
            'PT999' => 'PT999',
            '18K&PT950' => '18K&PT950',
            'S990' => 'S990',
            'S925' => 'S925',
            '足金' => '足金',
            '千足银' => '千足银',
            '千足金' => '千足金',
            '千足金银' => '千足金银',
            '裸石' => '裸石',
            '无' => '无',
            '其它' => '其它',
            'S999' => 'S999',
        ],
        'is_on_sale'=>[
            '1'=>'收货中',
            '2'=>'库存',
            '3'=>'已销售',
            //'4'=>'盘点中',
            '5'=>'调拨中',
            //'6'=>'损益中',
            //'7'=>'已报损',
            '8'=>'返厂中',
            '9'=>'已返厂',
            '10'=>'销售中',
            '11'=>'退货中',
            //'12'=>'作废',
        ],
        'weixiu_status'=>[
            '1'=>'维修取消',
            '2'=>'维修申请',
            '3'=>'维修受理',
            '4'=>'维修完成',
            '5'=>'待发货',
            '6'=>'转仓中',
        ],
        'out_warehouse_type'=>[
            '1'=>'购买',
            '2'=>'借货'
        ],
        'in_warehouse_type'=>[
            '1'=>'购买',
            '2'=>'委托加工',
            '3'=>'代销',
            '4'=>'借入',
            '5'=>'自采'
        ],
        'pifa_sub_type'=>[
            '1'=>'购买',
            '4'=>'借货'
        ],
        'sales_type'=>[
            'LS'=>'零售',
            'PF'=>'批发',
            //'WX'=>'维修',
        ],
        'allot_type'=>[
            'ZC'=>'转仓',
            'WX'=>'维修'
        ],
        'return_type'=>[
            'LS'=>'零售',
            'PF'=>'批发',
            'WX'=>'维修',
        ],
        'bill_goods_settle_type'=>[
            '0'=>'未结算',
            '1'=>'已结算',
            '2'=>'已退货'
        ],
        'settle_type'=>[
            '0'=>'未结算',
            '1'=>'已结算',
        ],
        'pifa_sub_type'=>[
            '9'=>'天生一对',
            '8'=>'散客内购',
            '7'=>'联营客单',
            '6'=>'联营备货',
            '5'=>'附加销售',
            '4'=>'指定外采',
            '3'=>'新店首批',
            '2'=>'经销商客单',
            '1'=>'经销商备货',
        ],
        'pifa_type'=>[
            '9'=>'天生一对',
            '8'=>'散客内购',
            '7'=>'联营客单',
            '6'=>'联营备货',
            '5'=>'附加销售',
            '4'=>'指定外采',
            '3'=>'新店首批',
            '2'=>'经销商客单',
            '1'=>'经销商备货',
        ],
        'carat' =>[
            '0.00~0.10'=>'10分以下',
            '0.10~0.20'=>'10分~20分',
            '0.20~0.30'=>'20分~30分',
            '0.30~0.40'=>'30分~40分',
            '0.40~0.50'=>'40分~50分',
            '0.50~0.60'=>'50分~60分',
            '0.60~0.70'=>'60分~70分',
            '0.70~0.80'=>'70分~80分',
            '0.80~0.90'=>'80分~90分',
            '0.90~1.00'=>'90分~100分',
            '1.00~1.50'=>'100分~150分',
            '1.50~100.00'=>'150分以上',
        ],
        'store_lz_jijialv'=>[
            'HRD-D'=>[2.1 , 2.1 , 2.2 , 1.7 , 1.7 , 1.5 , 1.4 , 1.4 , 1.4 , 1.4, 1.3, 1.18],
            'GIA'=>[2.1 , 2.1 , 2.1 , 1.6 , 1.6 , 1.5 , 1.5 , 1.5 , 1.5 , 1.5 , 1.4, 1.2],
            'HRD'=>[2.1 , 2.1 , 2.2 , 1.7 , 1.7 , 1.5 , 1.4 , 1.4 , 1.4 , 1.4, 1.3, 1.18],
            'IGI'=>[2.1 , 2.1 , 2.1 , 2.1 , 2.1 , 1.643 , 1.546 , 1.546 , 1.546 , 1.546 , 1.457, 1.2],
            'DIA'=>[2.1 , 2.1 , 2.1 , 2.1 , 2.1 , 1.643 , 1.546 , 1.546 , 1.546 , 1.546 , 1.457, 1.2],
            'EGL'=>[2.1 , 2.1 , 2.1 , 2.1 , 2.1 , 1.643 , 1.546 , 1.546 , 1.546 , 1.546 , 1.457, 1.2],
            'NGTC'=>[2.1 , 2.1 , 2.1 , 2.1 , 2.1 , 1.643 , 1.546 , 1.546 , 1.546 , 1.546 , 1.457, 1.2],
            'NGGC'=>[2.1 , 2.1 , 2.1 , 2.1 , 2.1 , 1.643 , 1.546 , 1.546 , 1.546 , 1.546 , 1.457, 1.2],
            'HRD-S'=>[2.1 , 2.1 , 2.2 , 1.7 , 1.7 , 1.5 , 1.4 , 1.4 , 1.4 , 1.4, 1.3, 1.18],
            'NGSTC'=>[2.1 , 2.1 , 2.1 , 2.1 , 2.1 , 1.643 , 1.546 , 1.546 , 1.546 , 1.546 , 1.457, 1.2],
            'default'=>'2.1',
        ],

        'store_lz_moren_jijialv'=>[
            //'HRD-D'=>[1.95 , 1.95 , 1.95 , 2 , 2 , 1.7 , 1.6 , 1.6 , 1.6 , 1.6, 1.55, 1.25],
            'HRD-D'=>[2.5, 2.5, 2.5, 2.2, 1.8, 1.65, 1.65, 1.65, 1.6, 1.6, 1.55, 1.25],
            'GIA'=>[1.95 , 1.95 , 1.95 , 2.2 , 2.2 , 1.8 , 1.8 , 1.8 , 1.8 , 1.8 , 1.6, 1.25],
            'HRD'=>[1.95 , 1.95 , 1.95 , 2 , 2 , 1.7 , 1.6 , 1.6 , 1.6 , 1.6, 1.55, 1.25],
            'IGI'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'DIA'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'EGL'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'NGTC'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'NGGC'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'HRD-S'=>[1.95 , 1.95 , 1.95 , 2 , 2 , 1.7 , 1.6 , 1.6 , 1.6 , 1.6, 1.55, 1.25],
            'NGSTC'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'default'=>'2',
        ],

        'store_lz_qihuo_moren_jijialv'=>[
            //'HRD-D'=>[1.95 , 1.95 , 1.95 , 2 , 2 , 1.7 , 1.6 , 1.6 , 1.6 , 1.6, 1.55, 1.25],
            'HRD-D'=>[2.5, 2.5, 2.5, 2.2, 1.8, 1.75, 1.8, 1.8, 1.6, 1.6, 1.55, 1.25],
            'GIA'=>[1.95 , 1.95 , 1.95 , 2.2 , 2.2 , 1.8 , 1.8 , 1.8 , 1.8 , 1.8 , 1.6, 1.25],
            'HRD'=>[1.95 , 1.95 , 1.95 , 2 , 2 , 1.7 , 1.6 , 1.6 , 1.6 , 1.6, 1.55, 1.25],
            'IGI'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'DIA'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'EGL'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'NGTC'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'NGGC'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'HRD-S'=>[1.95 , 1.95 , 1.95 , 2 , 2 , 1.7 , 1.6 , 1.6 , 1.6 , 1.6, 1.55, 1.25],
            'NGSTC'=>[1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95 , 1.95, 1.95],
            'default'=>'2',
        ],

        'voucher_goods_type'=> [
            1=>'普通<0.5克拉',
            2=>'普通0.5（含）~1.0克拉',
            3=>'普通1.0（含）~1.5克拉',
            4=>'普通1.5（含）克拉以上',
            5=>'星耀<0.5克拉',
            6=>'星耀0.5（含）~1.0克拉',
            7=>'星耀1.0（含）~1.5克拉',
            8=>'星耀1.5（含）克拉以上',
            9=>'天生一对裸石',
            10=>'天生一对成品',
            11=>'成品',
            12=>'香邂巴黎',
            13=>'皇室公主'

        ],

        'voucher_goods_jiajialv'=> [
            1=>0.75,
            2=>0.75,
            3=>0.75,
            4=>0.75,
            5=>0.9,
            6=>0.9,
            7=>0.9,
            8=>0.9,
            9=>0.95,
            10=>0.9,
            11=>0.75,
            12=>0.95,
            13=>0.95
        ],
        
        'style_sex'=> [
            1=>'男',
            2=>'女',
            3=>'中性',            
        ],
        'confirm'=> [
            1=>'是',
            0=>'否',
        ],
        'style_check'=>[
            1=>"保存",
            2=>"提交申请",
            3=>"已审核",
            4=>"未通过",
            5=>"作废",
        ],
        'diamond_recommend' =>[
            'certificate'=>['HRD-S'],
            'carat_min'=>0.4,
            'carat_max'=>0.59,
            'color'=>['E'],
            'clarity'=>['VS2'],
            'cut'=>['EX']
        ]
        
    ];

}

